#=====================================================================
#  Licensed to the Apache Software Foundation (ASF) under one or more
#  contributor license agreements.  See the NOTICE file distributed with
#  this work for additional information regarding copyright ownership.
#  The ASF licenses this file to You under the Apache License, Version 2.0
#  (the "License"); you may not use this file except in compliance with
#  the License.  You may obtain a copy of the License at
#
#     http://www.apache.org/licenses/LICENSE-2.0
#
#  Unless required by applicable law or agreed to in writing, software
#  distributed under the License is distributed on an "AS IS" BASIS,
#  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
#  See the License for the specific language governing permissions and
#  limitations under the License.
#=====================================================================
# $Rev$ $Date$

ajax.progressbar.processing = \u51e6\u7406\u4e2d...

car.addRepository.currentlyPluginRepositories = \u73fe\u5728\u5229\u7528\u53ef\u80fd\u306a\u30d7\u30e9\u30b0\u30a4\u30f3\u30fb\u30ea\u30dd\u30b8\u30c8\u30ea\u30fc\u306f\u3001\u4ee5\u4e0b\u306e\u3068\u304a\u308a\u3067\u3059
car.addRepository.downloadRunningCongfig      = \u307e\u305f\u3001\u30b5\u30fc\u30c9\u30fb\u30d1\u30fc\u30c6\u30a3\u30fc\u306e\u30d7\u30e9\u30b0\u30a4\u30f3\u3092\u95b2\u89a7\u3001\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3059\u308b\u969b\u3001\u5225\u306e Geronimo \u30b5\u30fc\u30d0\u30fc\u304b\u3089\u5b9f\u884c\u4e2d\u306e\u69cb\u6210\u3092\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u3059\u308b\u3053\u3068\u3082\u53ef\u80fd\u3067\u3059\u3002\u30ea\u30e2\u30fc\u30c8 Geronimo \u30b5\u30fc\u30d0\u30fc\u3092\u6307\u5b9a\u3057\u305f\u3044\u5834\u5408\u3001<tt>http://geronimo-server:8080/plugin/maven-repo/</tt> \u3068\u3044\u3063\u305f URL \u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
car.addRepository.howToAddPluginRepositories  = \u3053\u306e\u30ea\u30b9\u30c8\u306b\u65b0\u898f\u30d7\u30e9\u30b0\u30a4\u30f3\u30fb\u30ea\u30dd\u30b8\u30c8\u30ea\u30fc\u3092\u8ffd\u52a0\u3059\u308b\u306b\u306f\u3001\u30ea\u30dd\u30b8\u30c8\u30ea\u30fc\u306b URL \u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u3053\u306e\u30ea\u30dd\u30b8\u30c8\u30ea\u30fc\u306b\u306f\u3001\u30ea\u30dd\u30b8\u30c8\u30ea\u30fc\u304b\u3089\u5229\u7528\u53ef\u80fd\u306a\u30d7\u30e9\u30b0\u30a4\u30f3\u3092\u4e00\u89a7\u5316\u3057\u3066\u3044\u308b\u30eb\u30fc\u30c8\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u4e0a\u306b <tt>geronimo-plugins.xml</tt> \u30d5\u30a1\u30a4\u30eb\u3092\u914d\u7f6e\u3057\u3066\u3044\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
car.addRepository.title                       = \u30d7\u30e9\u30b0\u30a4\u30f3\u30fb\u30ea\u30dd\u30b8\u30c8\u30ea\u30fc\u306e\u8ffd\u52a0
car.assemblyConfirm.description               = \u8a18\u8ff0
car.assemblyConfirm.moduleId                  = \u30e2\u30b8\u30e5\u30fc\u30eb ID
car.assemblyConfirm.plugin                    = \u30d7\u30e9\u30b0\u30a4\u30f3
car.common.addRepository                      = \u30ea\u30dd\u30b8\u30c8\u30ea\u30fc\u306e\u8ffd\u52a0
car.common.assemble                           = \u30a2\u30bb\u30f3\u30d6\u30eb
car.common.author                             = \u8457\u4f5c\u8005
car.common.category                           = \u30ab\u30c6\u30b4\u30ea\u30fc
car.common.createGeronimoPlugin               = Geronimo \u30d7\u30e9\u30b0\u30a4\u30f3\u306e\u4f5c\u6210
car.common.dependencies                       = \u4f9d\u5b58\u30e2\u30b8\u30e5\u30fc\u30eb
car.common.downloadRepositories               = \u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u30fb\u30ea\u30dd\u30b8\u30c8\u30ea\u30fc
car.common.exportPlugin                       = \u30d7\u30e9\u30b0\u30a4\u30f3\u306e\u30a8\u30af\u30b9\u30dd\u30fc\u30c8
car.common.geronimoVersions                   = Geronimo \u30d0\u30fc\u30b8\u30e7\u30f3
car.common.group                              = \u30b0\u30eb\u30fc\u30d7
car.common.license                            = \u30e9\u30a4\u30bb\u30f3\u30b9
car.common.moduleID                           = \u30e2\u30b8\u30e5\u30fc\u30eb ID
car.common.newRepository                      = \u65b0\u898f\u30ea\u30dd\u30b8\u30c8\u30ea\u30fc
car.common.obsoletes                          = \u4e0d\u7528\u306a\u30e2\u30b8\u30e5\u30fc\u30eb
car.common.openSource                         = \u30aa\u30fc\u30d7\u30f3\u30bd\u30fc\u30b9
car.common.pluginURL                          = \u30d7\u30e9\u30b0\u30a4\u30f3 URL
car.common.prereq1Description                 = \u5fc5\u8981\u6761\u4ef61 \u8a18\u8ff0
car.common.prereq2Description                 = \u5fc5\u8981\u6761\u4ef62 \u8a18\u8ff0
car.common.prereq3Description                 = \u5fc5\u8981\u6761\u4ef63 \u8a18\u8ff0
car.common.prerequisite1ID                    = \u5fc5\u8981\u6761\u4ef61 ID
car.common.prerequisite1Type                  = \u5fc5\u8981\u6761\u4ef61 \u30bf\u30a4\u30d7
car.common.prerequisite2ID                    = \u5fc5\u8981\u6761\u4ef62 ID
car.common.prerequisite2Type                  = \u5fc5\u8981\u6761\u4ef62 \u30bf\u30a4\u30d7
car.common.prerequisite3ID                    = \u5fc5\u8981\u6761\u4ef63 ID
car.common.prerequisite3Type                  = \u5fc5\u8981\u6761\u4ef63 \u30bf\u30a4\u30d7
car.common.prerequisites                      = \u5fc5\u8981\u6761\u4ef6
car.common.proprietary                        = \u6240\u6709\u8005
car.common.removePlugins                      = Geronimo \u30d7\u30e9\u30b0\u30a4\u30f3\u306e\u524a\u9664
car.common.repository                         = \u30ea\u30dd\u30b8\u30c8\u30ea\u30fc
car.common.savePluginData                     = \u30d7\u30e9\u30b0\u30a4\u30f3\u30fb\u30c7\u30fc\u30bf\u306e\u4fdd\u5b58
car.common.searchForPlugins                   = \u9078\u629e\u3055\u308c\u305f\u30ea\u30dd\u30b8\u30c8\u30ea\u30fc\u306e\u30d7\u30e9\u30b0\u30a4\u30f3\u3092\u8868\u793a
car.common.uniqueID                           = \u30e6\u30cb\u30fc\u30af ID
car.common.viewDetails                        = \u8a73\u7d30\u3092\u898b\u308b
car.common.webSite                            = Web \u30b5\u30a4\u30c8
car.confirmExport.title                       = <b>\u30d7\u30e9\u30b0\u30a4\u30f3\u306e\u30a8\u30af\u30b9\u30dd\u30fc\u30c8</b> -- \u30c7\u30a3\u30b9\u30af\u306b\u4fdd\u5b58
car.confirmExport.useBtnBelow                 = \u30d7\u30e9\u30b0\u30a4\u30f3 "{0}" \u3092\u30c7\u30a3\u30b9\u30af\u306b\u4fdd\u5b58\u3059\u308b\u306b\u306f\u3001\u4e0b\u306e\u30dc\u30bf\u30f3\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002
car.download.foundDependencies                = \u3053\u306e\u30d7\u30e9\u30b0\u30a4\u30f3\u306b\u5fc5\u8981\u3068\u306a\u308b\u4ee5\u4e0b\u306e\u4f9d\u5b58\u30e2\u30b8\u30e5\u30fc\u30eb\u3092\u898b\u3064\u3051\u307e\u3057\u305f\u3002\u305d\u306e\u307e\u307e\u7d9a\u884c\u3059\u308b\u3068\u3001\u8db3\u308a\u306a\u3044\u4f9d\u5b58\u30e2\u30b8\u30e5\u30fc\u30eb\u3092\u81ea\u52d5\u7684\u306b\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3057\u307e\u3059\u3002
car.download.processing                       = {0} \u3092\u51e6\u7406\u4e2d...
car.downloadStatus.processing                 = \u73fe\u5728\u30d5\u30a1\u30a4\u30eb\u3092\u64cd\u4f5c\u4e2d...
car.index.assembleServer                      = \u30b5\u30fc\u30d0\u30fc\u306e\u30a2\u30bb\u30f3\u30d6\u30eb
car.index.assembleServerLong                  = \u3053\u306e\u30b5\u30fc\u30d0\u30fc\u306e\u30d7\u30e9\u30b0\u30a4\u30f3\u3088\u308a\u30b5\u30fc\u30d0\u30fc\u3092\u30a2\u30bb\u30f3\u30d6\u30eb
car.index.createGeronimoPluginExp             = Geronimo \u30d7\u30e9\u30b0\u30a4\u30f3\u3068\u3057\u3066\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3059\u308b\u306b\u306f\u3001\u73fe\u5728\u306e Geronimo \u30b5\u30fc\u30d0\u30fc\u306b\u3042\u308b\u69cb\u6210\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u69cb\u6210\u306f\u3001\u30ed\u30fc\u30ab\u30eb\u30fb\u30d5\u30a1\u30a4\u30eb\u30b7\u30b9\u30c6\u30e0\u306b CAR \u30d5\u30a1\u30a4\u30eb\u3068\u3057\u3066\u4fdd\u5b58\u3055\u308c\u307e\u3059\u3002<i>\u6ce8\u610f: \u73fe\u5728\u3001\u6709\u52b9\u306a\u30d7\u30e9\u30b0\u30a4\u30f3\u306b\u5bfe\u3057\u3066\u9069\u5207\u306b\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3057\u305f\u5f8c\u3001CAR \u306b\u5bfe\u3057\u3066 <tt>META-INF/geronimo-plugin.xml</tt> \u30d5\u30a1\u30a4\u30eb\u3092\u624b\u52d5\u3067\u8ffd\u52a0\u3057\u306a\u3051\u308c\u3070\u3044\u3051\u307e\u305b\u3093\u3002</i>
car.index.optionalAuthentication              = \u30aa\u30d7\u30b7\u30e7\u30f3\u8a8d\u8a3c
car.index.removePluginsExp                    = \u30d7\u30e9\u30b0\u30a4\u30f3\u3092\u524a\u9664\u3059\u308b\u306b\u306f\u3001\u30d7\u30e9\u30b0\u30a4\u30f3\u30fb\u30e2\u30b8\u30e5\u30fc\u30eb\u3092\u914d\u7f6e\u3057\u3066\u3044\u308b<b>\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3</b>\u306e\u30ab\u30c6\u30b4\u30ea\u30fc\u3092\u4f7f\u7528\u3057\u3001\u30a2\u30f3\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3057\u3066\u304f\u3060\u3055\u3044\u3002
car.index.summary                             = <h2>Geronimo \u30d7\u30e9\u30b0\u30a4\u30f3\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb</h2> <p>\u3053\u306e\u30dd\u30fc\u30c8\u30ec\u30c3\u30c8\u306b\u3088\u3063\u3066\u3001Geronimo \u30d7\u30e9\u30b0\u30a4\u30f3\u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3057\u307e\u3059\u3002\u30e9\u30f3\u30bf\u30a4\u30e0\u4e0a\u306e Geronimo \u30b5\u30fc\u30d0\u30fc\u306b\u65b0\u898f\u6a5f\u80fd\u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u53ef\u80fd\u3067\u3059\u3002</p> <p>\u5229\u7528\u53ef\u80fd\u306a Geronimo \u30d7\u30e9\u30b0\u30a4\u30f3\u3092\u8abf\u3079\u308b\u306b\u306f\u3001\u30ea\u30e2\u30fc\u30c8\u30fb\u30ea\u30dd\u30b8\u30c8\u30ea\u30fc\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u30ea\u30dd\u30b8\u30c8\u30ea\u30fc\u306b\u306f\u3001\u5229\u7528\u53ef\u80fd\u306a\u30d7\u30e9\u30b0\u30a4\u30f3\u3092\u30ea\u30b9\u30c8\u5316\u3057\u3066\u3044\u308b <tt>geronimo-plugins.xml</tt> \u30d5\u30a1\u30a4\u30eb\u304c\u30eb\u30fc\u30c8\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u306b\u3042\u308a\u307e\u3059\u3002</p> <p>\u30b5\u30fc\u30c9\u30fb\u30d1\u30fc\u30c6\u30a3\u30fc\u306e\u30d7\u30e9\u30b0\u30a4\u30f3\u306e\u95b2\u89a7\u3084\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3092\u3059\u308b\u5834\u5408\u3001\u5225\u306e Geronimo \u30b5\u30fc\u30d0\u30fc\u304b\u3089\u5b9f\u884c\u4e2d\u306e\u69cb\u6210\u3092\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u3059\u308b\u3053\u3068\u3082\u53ef\u80fd\u3067\u3059\u3002\u30ea\u30e2\u30fc\u30c8\u306e Geronimo \u30b5\u30fc\u30d0\u30fc\u3092\u6307\u5b9a\u3057\u305f\u3044\u5834\u5408\u3001<tt>http://geronimo-server:8080/plugin/maven-repo/</tt> \u306e\u3088\u3046\u306a URL \u3092\u5165\u529b\u3057\u3001\u7ba1\u7406\u8005\u306e\u30e6\u30fc\u30b6\u30fc\u540d\u3084\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u30aa\u30d7\u30b7\u30e7\u30f3\u8a8d\u8a3c\u306e\u9805\u76ee\u306b\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002</p>
car.index.updateRepositoryList                = \u30ea\u30dd\u30b8\u30c8\u30ea\u30fc\u30fb\u30ea\u30b9\u30c8\u306e\u66f4\u65b0
car.index.validateConfig                      = \u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3059\u308b\u69cb\u6210\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
car.list.assemblyArtifactId                   = \u30a2\u30bb\u30f3\u30d6\u30eb\u30fb\u30a2\u30fc\u30c6\u30a3\u30d5\u30a1\u30af\u30c8 ID:
car.list.assemblyFormat                       = \u30a2\u30bb\u30f3\u30d6\u30eb\u5f62\u5f0f:
car.list.assemblyGroupId                      = \u30a2\u30bb\u30f3\u30d6\u30eb\u30fb\u30b0\u30eb\u30fc\u30d7 ID:
car.list.assemblyName                         = \u30a2\u30bb\u30f3\u30d6\u30eb\u3059\u308b\u30b5\u30fc\u30d0\u30fc\u306e\u540d\u524d
car.list.assemblyPath                         = \u30a2\u30bb\u30f3\u30d6\u30eb\u30fb\u30bf\u30fc\u30b2\u30c3\u30c8\u30fb\u30d1\u30b9:
car.list.assemblyVersion                      = \u30a2\u30bb\u30f3\u30d6\u30eb\u30fb\u30d0\u30fc\u30b8\u30e7\u30f3:
car.list.noPlugins                            = \u3053\u306e\u30ea\u30dd\u30b8\u30c8\u30ea\u30fc\u30fb\u30ea\u30b9\u30c8\u306b\u30d7\u30e9\u30b0\u30a4\u30f3\u304c\u3042\u308a\u307e\u305b\u3093\u3002
car.list.pluginCategory                       = \u30ab\u30c6\u30b4\u30ea\u30fc
car.list.pluginInstallable                    = \u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u53ef\u80fd
car.list.pluginLocal                          = \u30ed\u30fc\u30ab\u30eb\u30fb\u30b5\u30fc\u30d0\u30fc\u306e\u30d7\u30e9\u30b0\u30a4\u30f3
car.list.pluginName                           = \u540d\u524d
car.list.pluginRepo                           = \u30d7\u30e9\u30b0\u30a4\u30f3\u4e00\u89a7
car.list.pluginVersion                        = \u30d0\u30fc\u30b8\u30e7\u30f3
car.pluginParams.JVMVersionsExp               = \u3053\u306e\u30d7\u30e9\u30b0\u30a4\u30f3\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u308b JVM \u30d0\u30fc\u30b8\u30e7\u30f3\u306e\u63a5\u982d\u8f9e\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u30fb\u30ea\u30b9\u30c8\u3002\u30ea\u30b9\u30c8\u306b\u4f55\u3082\u306a\u3044\u3068\u3001\u30d7\u30e9\u30b0\u30a4\u30f3\u306f JVM \u306e\u3042\u3089\u3086\u308b\u30d0\u30fc\u30b8\u30e7\u30f3\u3067\u5b9f\u884c\u3057\u3066\u3044\u308b Geronimo \u306b\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u53ef\u80fd\u3067\u3059\u3002\r\n\u305d\u3046\u3067\u306a\u3051\u308c\u3070\u3001\u5bfe\u5fdc\u3057\u3066\u3044\u308b JVM \u30d0\u30fc\u30b8\u30e7\u30f3\u30921\u884c\u5358\u4f4d\u3067\u30ea\u30b9\u30c8\u5316\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u4f8b\u3048\u3070\u3001"1.4.2&nbsp;\r\n&nbsp;1.5&nbsp;\r\n&nbsp;..." (\u3082\u3061\u308d\u3093\u3001\u3053\u306e\u3053\u3068\u306f\u3001\u539f\u5247\u3068\u3057\u3066\u3001\u3053\u3053\u306b\u30ea\u30b9\u30c8\u5316\u3055\u308c\u3066\u3044\u308b\u5404 JVM \u30d0\u30fc\u30b8\u30e7\u30f3\u306e\u4e0a\u3067 Geronimo \u3068\u3068\u3082\u306b\u30d7\u30e9\u30b0\u30a4\u30f3\u3092\u672c\u5f53\u306b\u30c6\u30b9\u30c8\u3057\u3066\u3044\u308b\u3053\u3068\u3092\u610f\u5473\u3057\u307e\u3059)\u3002
car.pluginParams.authorExp                    = \u500b\u4eba\u3001\u4f01\u696d\u3001\u30aa\u30fc\u30d7\u30f3\u30bd\u30fc\u30b9\u30fb\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3001\u7b49\u3092\u793a\u3059\u3001\u30d7\u30e9\u30b0\u30a4\u30f3\u306e\u8457\u8005\u3002
car.pluginParams.categoryExp                  = \u30d7\u30e9\u30b0\u30a4\u30f3\u3092\u533a\u5206\u3059\u308b\u30ab\u30c6\u30b4\u30ea\u30fc\u3002\u540c\u4e00\u30ab\u30c6\u30b4\u30ea\u30fc\u306e\u30d7\u30e9\u30b0\u30a4\u30f3\u306f\u3068\u3082\u306b\u30ea\u30b9\u30c8\u5316\u3055\u308c\u307e\u3059\u3002\u3053\u306e\u30d7\u30e9\u30b0\u30a4\u30f3\u3092 geronimoplugins.com \u3078\u30ea\u30b9\u30c8\u5316\u3059\u308b\u5834\u5408\u3001\u3069\u308c\u3082\u9069\u3057\u3066\u308b\u306e\u3067\u3042\u308c\u30701\u3064\u306e\u30ab\u30c6\u30b4\u30ea\u30fc\u540d\u3092\u4f7f\u7528\u3059\u3079\u304d\u3067\u3059\u3002\u305d\u3046\u3067\u306a\u3051\u308c\u3070\u3001\u81ea\u7531\u306b\u3001\u3082\u3057\u304f\u306f\u3001\u3053\u308c\u3092\u9001\u4ed8\u3059\u308b\u30ea\u30dd\u30b8\u30c8\u30ea\u30fc\u306b\u5bfe\u5fdc\u3059\u308b\u30ab\u30c6\u30b4\u30ea\u30fc\u306b\u3057\u305f\u304c\u3063\u3066\u3001\u9078\u629e\u53ef\u80fd\u3067\u3059\u3002
car.pluginParams.dependenciesExp              = \u3053\u306e\u30d7\u30e9\u30b0\u30a4\u30f3\u304c\u4f9d\u5b58\u3057\u3066\u3044\u308b JAR \u3084 \u4ed6\u306e\u30e2\u30b8\u30e5\u30fc\u30eb ID \u306e\u30ea\u30b9\u30c8\u3002\u3053\u308c\u3089\u306f\u3001\u5f53\u8a72\u30d7\u30e9\u30b0\u30a4\u30f3\u3092\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u3059\u308b\u969b\u306b\u81ea\u52d5\u7684\u306b\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u3055\u308c\u307e\u3059\u3002\u901a\u5e38\u3001\u3053\u306e\u30ea\u30b9\u30c8\u3092\u5909\u66f4\u3057\u3066\u306f\u3044\u3051\u307e\u305b\u3093\u3002\u3057\u304b\u3057\u306a\u304c\u3089\u3001\u30e6\u30fc\u30b6\u30fc\u304c\u30d7\u30e9\u30b0\u30a4\u30f3\u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3059\u308b\u524d\u306b\u624b\u52d5\u3067\u4f9d\u5b58\u30e2\u30b8\u30e5\u30fc\u30eb\u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3057\u306a\u3051\u308c\u3070\u306a\u3089\u306a\u3044\u5834\u5408\u3001\u4f9d\u5b58\u95a2\u4fc2\u306e\u30ea\u30b9\u30c8\u304b\u3089<b>\u5fc5\u8981\u6761\u4ef6</b>\u306e\u30ea\u30b9\u30c8\u306b\u30a8\u30f3\u30c8\u30ea\u30fc\u3092\u79fb\u52d5\u53ef\u80fd\u3067\u3059 (\u4f8b. \u30d7\u30e9\u30b0\u30a4\u30f3\u304c\u63a5\u7d9a\u5148\u306e\u30b5\u30fc\u30d0\u30fc\u3092\u8a8d\u8b58\u3057\u3066\u3044\u306a\u3044\u3068\u601d\u308f\u308c\u308b\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30fb\u30d7\u30fc\u30eb)\u3002<br /><br />\u3053\u306e\u30ea\u30b9\u30c8\u306e\u5404\u30a8\u30f3\u30c8\u30ea\u30fc\u306b\u306f\u3001\u524d\u8ff0\u306e\u3068\u304a\u308a\u3001\u3053\u306e\u30d7\u30e9\u30b0\u30a4\u30f3\u3067\u4f7f\u7528\u3055\u308c\u308b\u30e6\u30cb\u30fc\u30af ID \u5f62\u5f0f\u306e\u3088\u3046\u306a\u5024\u3092\u4f7f\u7528\u3059\u3079\u304d\u3067\u3059\u3002\u5371\u967a\u304b\u3082\u3057\u308c\u307e\u305b\u3093\u304c\u3001\u4f9d\u5b58\u95a2\u4fc2\u306e\u3069\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u3067\u3082\u52d5\u4f5c\u3055\u305b\u305f\u3044\u5834\u5408\u3001\u30d0\u30fc\u30b8\u30e7\u30f3\u756a\u53f7\u3092\u524a\u9664\u3059\u308b\u3053\u3068\u304c\u3042\u308b\u304b\u3082\u3057\u308c\u307e\u305b\u3093\u3002\u5404\u5024\u306f\u3001\u884c\u5206\u5272\u3057\u3066\u304f\u3060\u3055\u3044\u3002
car.pluginParams.descriptionExp               = \u3053\u306e\u30d7\u30e9\u30b0\u30a4\u30f3\u306e\u8aac\u660e\u3002\u30d1\u30e9\u30b0\u30e9\u30d5\u3092\u5206\u5272\u3059\u308b\u7a7a\u884c\u3082\u542b\u3081\u3001\u30d7\u30ec\u30fc\u30f3\u30fb\u30c6\u30ad\u30b9\u30c8\u306e\u307f\u3067\u8868\u73fe\u3057\u3066\u304f\u3060\u3055\u3044\u3002
car.pluginParams.downloadRepositoriesExp      = \u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u306b\u5fc5\u8981\u306a\u4f9d\u5b58\u95a2\u4fc2\u3092\u30c1\u30a7\u30c3\u30af\u3059\u308b\u30ea\u30dd\u30b8\u30c8\u30ea\u30fc\u306e\u30ea\u30b9\u30c8\u3002<tt>http://geronimoplugins.com/repository/</tt> \u3084 <tt>http://www.ibiblio.org/maven2/</tt> \u3068\u3044\u3063\u305f\u5024\u3092\u30011\u884c1URL\u3067\u30ea\u30b9\u30c8\u5316\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u3053\u306e\u30d7\u30e9\u30b0\u30a4\u30f3\u304c\u30c7\u30d7\u30ed\u30a4\u3055\u308c\u3066\u3044\u308b\u30ea\u30dd\u30b8\u30c8\u30ea\u30fc\u306f\u3001\u901a\u5e38\u30ea\u30b9\u30c8\u306e\u6700\u521d\u306b\u8a18\u8ff0\u3059\u3079\u304d\u3067\u3042\u308b\u3053\u3068\u306b\u6ce8\u610f\u3057\u3066\u304f\u3060\u3055\u3044\u3002
car.pluginParams.geronimoVersionsExp          = \u3053\u306e\u30d7\u30e9\u30b0\u30a4\u30f3\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u308b Geronimo \u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u306e\u30ea\u30b9\u30c8\u3002\u30ea\u30b9\u30c8\u306b\u4f55\u3082\u306a\u3044\u3068\u3001\u30d7\u30e9\u30b0\u30a4\u30f3\u306f Geronimo \u306e\u3069\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u3067\u3082\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u53ef\u80fd\u3067\u3059\u3002\u305d\u3046\u3067\u306a\u3051\u308c\u3070\u3001"1.1&nbsp;\r\n&nbsp;1.1.1&nbsp;\r\n&nbsp;1.1.2&nbsp;\r\n&nbsp;..." \u306e\u3088\u3046\u306b\u3001Geronimo \u30d0\u30fc\u30b8\u30e7\u30f3\u30921\u884c\u306b1\u4ef6\u305a\u3064\u30ea\u30b9\u30c8\u3067\u8a18\u8ff0\u3057\u3066\u304f\u3060\u3055\u3044 (\u3082\u3061\u308d\u3093\u3001\u7406\u60f3\u3067\u306f\u3001\u3053\u3053\u306b\u30ea\u30b9\u30c8\u5316\u3055\u308c\u305f\u5404 Geronimo \u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u3067\u5b9f\u969b\u306b\u30c6\u30b9\u30c8\u3055\u308c\u305f\u3053\u3068\u3092\u610f\u5473\u3057\u3066\u3044\u307e\u3059)\u3002
car.pluginParams.humanReadableName            = \u4eba\u304c\u8aad\u3080\u3053\u3068\u306e\u3067\u304d\u308b\u540d\u524d
car.pluginParams.humanReadableNameExp         = \u4eba\u304c\u8aad\u3080\u3053\u3068\u306e\u3067\u304d\u308b\u540d\u524d\u304c\u3001\u3053\u306e\u30d7\u30e9\u30b0\u30a4\u30f3\u306b\u8868\u793a\u3055\u308c\u307e\u3059\u3002
car.pluginParams.licenseExp                   = \u3053\u306e\u30d7\u30e9\u30b0\u30a4\u30f3\u306e\u30e9\u30a4\u30bb\u30f3\u30b9\u540d\u3002\u539f\u5247\u3068\u3057\u3066\u3001"BSD -- (\u540d\u524d)" \u3082\u3057\u304f\u306f "GPL -- (\u540d\u524d)" \u306e\u3088\u3046\u306b\u3001\u30e9\u30a4\u30bb\u30f3\u30b9\u306e\u7a2e\u985e\u3092\u524d\u306b\u4ed8\u3051\u307e\u3059\u3002
car.pluginParams.obsoletesExp                 = \u30d7\u30e9\u30b0\u30a4\u30f3\u304c\u7f6e\u63db\u3059\u308b\u30e2\u30b8\u30e5\u30fc\u30eb ID \u306e\u30ea\u30b9\u30c8\u3002\u305d\u308c\u3089\u306e\u30d7\u30e9\u30b0\u30a4\u30f3\u3084\u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3059\u308b\u3068\u524a\u9664\u3055\u308c\u307e\u3059\u3002\u8ffd\u52a0\u306e\u4ee3\u66ff\u624b\u6bb5\u3092\u63d0\u4f9b\u3059\u308b\u3088\u308a\u3080\u3057\u308d "\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9" \u3059\u308b\u305f\u3081\u306b\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3057\u305f\u3044\u5834\u5408\u3001\u5f53\u8a72\u30d7\u30e9\u30b0\u30a4\u30f3\u306e\u524d\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u3082\u542b\u307e\u308c\u307e\u3059\u30021\u884c\u306b1\u3064\u306e\u30e2\u30b8\u30e5\u30fc\u30eb ID \u3092\u8a18\u8ff0\u3057\u305f\u30ea\u30b9\u30c8\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
car.pluginParams.openSourceExp                = OSI \u304c\u627f\u8a8d\u3057\u3066\u3044\u308b\u30aa\u30fc\u30d7\u30f3\u30bd\u30fc\u30b9\u30fb\u30e9\u30a4\u30bb\u30f3\u30b9\u3067\u3042\u308c\u3070\u3001\u3053\u306e\u30dc\u30c3\u30af\u30b9\u3092\u30c1\u30a7\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044 (<a href="http://www.opensource.org/licenses/index.php">http://www.opensource.org/licenses/index.php</a>\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044)\u3002
car.pluginParams.pluginURLExp                 = \u30d7\u30e9\u30b0\u30a4\u30f3\u306b\u95a2\u3059\u308b\u60c5\u5831\u3092\u53d6\u5f97\u3059\u308b\u305f\u3081\u306e URL (\u4f8b. \u30d7\u30e9\u30b0\u30a4\u30f3\u306e\u30db\u30fc\u30e0\u30da\u30fc\u30b8)\u3002
car.pluginParams.prereqDescriptionExp         = \u30e6\u30fc\u30b6\u30fc\u304c\u5fc5\u8981\u6761\u4ef6 (\u4f8b\u3048\u3070\u3001\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u308b\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u88fd\u54c1\u3092\u30ea\u30b9\u30c8\u5316\u3057\u305f\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30fb\u30d7\u30fc\u30eb\u306e\u30bb\u30c3\u30c8\u30a2\u30c3\u30d7\u624b\u9806\u3084\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3092\u521d\u671f\u5316\u3059\u308b\u30b9\u30af\u30ea\u30d7\u30c8\u3092\u63a2\u3059\u5834\u6240\u3092\u30e6\u30fc\u30b6\u30fc\u306b\u63d0\u793a\u3059\u308b) \u3092\u6e80\u305f\u3059\u305f\u3081\u306b\u3059\u3079\u304d\u5185\u5bb9\u306b\u95a2\u3059\u308b\u8a73\u7d30\u306a\u8a18\u8ff0\u3002\u3053\u308c\u306f\u3001\u30d1\u30e9\u30b0\u30e9\u30d5\u3092\u5206\u5272\u3059\u308b\u7a7a\u884c\u3082\u542b\u3081\u305f\u30d7\u30ec\u30fc\u30f3\u30fb\u30c6\u30ad\u30b9\u30c8\u306e\u307f\u3067\u8868\u8a18\u3057\u3066\u304f\u3060\u3055\u3044\u3002
car.pluginParams.prerequisiteIDExp            = \u3053\u306e\u30d7\u30e9\u30b0\u30a4\u30f3\u306e\u5fc5\u8981\u6761\u4ef6\u3068\u306a\u308b\u30e2\u30b8\u30e5\u30fc\u30eb ID\u3002\u3053\u308c\u306f\u3001\u30d7\u30e9\u30b0\u30a4\u30f3\u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3059\u308b\u524d\u306b\u30b5\u30fc\u30d0\u30fc\u3078\u63d0\u4f9b\u3055\u308c\u3066\u3044\u306a\u3051\u308c\u3070\u306a\u3089\u306a\u3044\u30e2\u30b8\u30e5\u30fc\u30eb\u3067\u3059\u3002Web \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u5c02\u7528 Web \u30b3\u30f3\u30c6\u30ca\u30fc (<tt>geronimo/jetty/*/car</tt>) \u306e\u3088\u3046\u306a\u3082\u306e\u3067\u3042\u3063\u305f\u308a\u3001\u30e6\u30fc\u30b6\u30fc\u304c\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3057\u306a\u3051\u308c\u3070\u306a\u3089\u306a\u3044\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30fb\u30d7\u30fc\u30eb\u3084\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30ec\u30eb\u30e0\u306e\u3088\u3046\u306a\u3082\u306e\u3067\u3059\u3002\u3068\u3044\u3046\u306e\u3082\u3001\u30d7\u30e9\u30b0\u30a4\u30f3\u306e\u8457\u8005\u306f\u9001\u4fe1\u5148\u30b5\u30fc\u30d0\u30fc\u306b\u6709\u52b9\u306a\u5024\u3092\u4f5c\u6210\u3067\u304d\u306a\u3044\u304b\u3089\u3067\u3059\u3002\u3088\u308a\u591a\u304f\u306e\u30e6\u30fc\u30b6\u30fc\u306b\u63d0\u4f9b\u3059\u308b\u305f\u3081\u3001\u3067\u304d\u308b\u3060\u3051\u591a\u69d8\u306a\u30e2\u30b8\u30e5\u30fc\u30eb ID \u306e\u30bb\u30b0\u30e1\u30f3\u30c8\u306b\u3057\u3066\u304a\u304d\u305f\u3044\u3067\u3059 (\u4f8b. <tt>myapp/mypool/1.2/car</tt> \u3088\u308a\u3080\u3057\u308d <tt>*/mypool/*/*</tt>)\u3002
car.pluginParams.prerequisiteTypeExp          = (\u30e6\u30fc\u30b6\u30fc\u306e\u52a9\u3051\u3068\u306a\u308b) \u5fc5\u8981\u6761\u4ef6\u306e\u30bf\u30a4\u30d7\u306b\u95a2\u3059\u308b\u7c21\u5358\u306a\u8a18\u8ff0\u3002\u4f8b\u3048\u3070\u3001<tt>\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30fb\u30d7\u30fc\u30eb</tt>\u3001\u307e\u305f\u306f\u3001<tt>Web \u30b3\u30f3\u30c6\u30ca\u30fc</tt>\u3092\u542b\u3093\u3067\u3044\u307e\u3059\u3002
car.pluginParams.title                        = <b>\u30d7\u30e9\u30b0\u30a4\u30f3\u306e\u30a8\u30af\u30b9\u30dd\u30fc\u30c8</b> -- \u30d7\u30e9\u30b0\u30a4\u30f3\u30fb\u30c7\u30fc\u30bf\u306e\u69cb\u6210
car.pluginParams.uniqueIDExp                  = \u3053\u306e\u30d7\u30e9\u30b0\u30a4\u30f3\u306e\u30b0\u30ed\u30fc\u30d0\u30eb\u306a\u30e6\u30cb\u30fc\u30af ID\u3002\u3053\u308c\u306f\u3001\u3042\u306a\u305f\u304c\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3057\u3066\u3044\u308b\u30b5\u30fc\u30d0\u30fc\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u304b\u3089\u6c7a\u5b9a\u3055\u308c\u307e\u3059\u3002\u30d7\u30e9\u30b0\u30a4\u30f3\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u756a\u53f7\u3092\u5b9a\u7fa9\u3057\u3066\u3044\u307e\u3059\u306e\u3067\u3001\u6b63\u3057\u3044\u5024\u3067\u3042\u308b\u304b\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
car.results.filesProcessed                    = \u51e6\u7406\u6e08\u30d5\u30a1\u30a4\u30eb
car.results.title                             = \u30d7\u30e9\u30b0\u30a4\u30f3 {0} \u306f\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u307e\u3057\u305f\u3002
car.results.titles                            = \u4ee5\u4e0b\u306e\u30d7\u30e9\u30b0\u30a4\u30f3\u304c\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u307e\u3057\u305f\u3002
car.viewForDownload.author                    = \u8457\u8005
car.viewForDownload.dependencies              = \u4f9d\u5b58\u30e2\u30b8\u30e5\u30fc\u30eb
car.viewForDownload.description               = \u8a18\u8ff0
car.viewForDownload.geronimoVersions          = Geronimo \u30d0\u30fc\u30b8\u30e7\u30f3
car.viewForDownload.group                     = \u30b0\u30eb\u30fc\u30d7
car.viewForDownload.installable               = \u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u53ef\u80fd
car.viewForDownload.jvmVersions               = JVM \u30d0\u30fc\u30b8\u30e7\u30f3
car.viewForDownload.license                   = \u30e9\u30a4\u30bb\u30f3\u30b9
car.viewForDownload.moduleId                  = \u30e2\u30b8\u30e5\u30fc\u30eb ID
car.viewForDownload.obsoletes                 = \u4e0d\u7528\u306a\u30e2\u30b8\u30e5\u30fc\u30eb
car.viewForDownload.prerequisites             = \u5fc5\u8981\u6761\u4ef6
car.viewForDownload.website                   = Web \u30b5\u30a4\u30c8

configmanager.common.archive                     = \u30a2\u30fc\u30ab\u30a4\u30d6
configmanager.common.plan                        = \u30d7\u30e9\u30f3
configmanager.common.startAppAfterInstall        = \u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u5f8c\u306b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u59cb\u52d5\u3059\u308b
configmanager.deploy.migratedPlan                = \u79fb\u884c\u30d7\u30e9\u30f3
configmanager.deploy.migratedPlanSummary         = \u63d0\u4f9b\u3055\u308c\u305f\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u30fb\u30d7\u30e9\u30f3\u306f\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u306e\u524d\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u306b\u3042\u308a\u307e\u3059\u3002\u30d7\u30e9\u30f3\u306e\u79fb\u884c\u30d0\u30fc\u30b8\u30e7\u30f3\u306f\u3001\u3042\u306a\u305f\u306e\u90fd\u5408\u306b\u3042\u308f\u305b\u3066\u4ee5\u4e0b\u306e\u3088\u3046\u306b\u63d0\u4f9b\u3055\u308c\u307e\u3059\u3002\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u30fb\u30d7\u30e9\u30f3\u306f\u5b8c\u5168\u306b\u79fb\u884c\u3067\u304d\u308b\u308f\u3051\u3067\u306f\u306a\u3044\u305f\u3081\u3001\u79fb\u884c\u30d7\u30e9\u30f3\u3092\u30c7\u30d7\u30ed\u30a4\u3067\u304d\u308b\u3088\u3046\u306b\u3059\u308b\u524d\u306b\u3001\u624b\u4f5c\u696d\u306b\u3088\u308b\u7de8\u96c6\u304c\u3044\u304f\u3064\u304b\u5fc5\u8981\u3067\u3059\u3002
configmanager.deploy.originalPlan                = \u30aa\u30ea\u30b8\u30ca\u30eb\u30fb\u30d7\u30e9\u30f3
configmanager.deploy.redeployApplication         = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u518d\u30c7\u30d7\u30ed\u30a4\u3059\u308b
configmanager.deploy.saveLocally                 = \u3053\u306e\u30d7\u30e9\u30f3\u3092\u30ed\u30fc\u30ab\u30eb\u306b\u4fdd\u5b58
configmanager.deploy.showMigratedPlan            = \u79fb\u884c\u30d7\u30e9\u30f3\u3092\u8868\u793a
configmanager.deploy.showOriginalPlan            = \u30aa\u30ea\u30b8\u30ca\u30eb\u30fb\u30d7\u30e9\u30f3\u3092\u8868\u793a
configmanager.deployHelp.archiveExp              = \u30a2\u30fc\u30ab\u30a4\u30d6\u6b04\u306b war \u30d5\u30a1\u30a4\u30eb\u3092\u6307\u5b9a\u3059\u308b\u306b\u306f\u3001\u53c2\u7167... \u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002
configmanager.deployHelp.installApplication      = Geronimo \u30b5\u30fc\u30d0\u30fc\u306b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3057\u307e\u3059\u3002
configmanager.deployHelp.planExp                 = \u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u30fb\u30d7\u30e9\u30f3\u304c war \u30d5\u30a1\u30a4\u30eb\u304b\u3089\u5206\u5272\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u306b\u3001\u53c2\u7167... \u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
configmanager.deployHelp.startAppAfterInstallExp = \u3053\u308c\u3092\u30c1\u30a7\u30c3\u30af\u3059\u308b\u3068\u3001\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u6642\u306b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u81ea\u52d5\u7684\u306b\u59cb\u52d5\u3057\u307e\u3059\u3002\u305d\u3046\u3067\u306a\u3051\u308c\u3070\u3001 &quot;\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u6e08\u307f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3&quot;\u30a6\u30a3\u30f3\u30c9\u30a6\u306b\u3042\u308b&quot;\u59cb\u52d5&quot;\u30c8\u30b0\u30eb\u3092\u30af\u30ea\u30c3\u30af\u3059\u308b\u3053\u3068\u3067\u59cb\u52d5\u3059\u308b\u3053\u3068\u304c\u53ef\u80fd\u3067\u3059\u3002\u30c7\u30d5\u30a9\u30eb\u30c8\u3067\u306f\u3001\u3053\u306e\u30c1\u30a7\u30c3\u30af\u30fb\u30dc\u30c3\u30af\u30b9\u306f\u30c1\u30a7\u30c3\u30af\u72b6\u614b\u306b\u306a\u3063\u3066\u304a\u308a\u3001\u65b0\u898f\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u308b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306f\u81ea\u52d5\u7684\u306b\u59cb\u52d5\u3055\u308c\u307e\u3059\u3002
configmanager.deployHelp.title                   = \u3053\u306e\u30dd\u30fc\u30c8\u30ec\u30c3\u30c8\u3092\u4f7f\u3063\u3066\u3001\u30e6\u30fc\u30b6\u30fc\u306f\u65b0\u898f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092 Geronimo \u306b\u30c7\u30d7\u30ed\u30a4\u3067\u304d\u307e\u3059\u3002Web \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u306f\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u30fb\u30d7\u30e9\u30f3\u304c\u5fc5\u8981\u3067\u3001war \u30d5\u30a1\u30a4\u30eb\u306b\u540c\u68b1\u3059\u308b\u304b\u3001geronimo-web.xml \u3068\u547c\u3070\u308c\u308b\u30d5\u30a1\u30a4\u30eb\u3092\u5206\u5272\u3057\u3066\u3001\u30c7\u30d7\u30ed\u30a4\u3059\u308b\u304b\u306e\u3069\u3061\u3089\u304b\u306b\u306a\u308a\u307e\u3059\u3002

consolebase.common.JVMVersions     = JVM \u30d0\u30fc\u30b8\u30e7\u30f3
consolebase.common.actions         = \u30a2\u30af\u30b7\u30e7\u30f3
consolebase.common.cancel          = \u30ad\u30e3\u30f3\u30bb\u30eb
consolebase.common.commands        = \u30b3\u30de\u30f3\u30c9
consolebase.common.confirmPassword = \u78ba\u8a8d\u30d1\u30b9\u30ef\u30fc\u30c9
consolebase.common.delete          = \u524a\u9664
consolebase.common.deployedAs      = \u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u30fb\u30b9\u30b3\u30fc\u30d7
consolebase.common.description     = \u8a18\u8ff0
consolebase.common.done            = \u5b8c\u4e86
consolebase.common.edit            = \u7de8\u96c6
consolebase.common.install         = \u30a4\u30f3\u30b9\u30c8\u30fc\u30eb
consolebase.common.name            = \u540d\u524d
consolebase.common.next            = \u6b21\u3078
consolebase.common.password        = \u30d1\u30b9\u30ef\u30fc\u30c9
consolebase.common.restart         = \u518d\u59cb\u52d5
consolebase.common.return          = \u623b\u308b
consolebase.common.returnToList    = \u4e00\u89a7\u306b\u623b\u308b
consolebase.common.save            = \u4fdd\u5b58
consolebase.common.start           = \u59cb\u52d5
consolebase.common.state           = \u72b6\u614b
consolebase.common.stop            = \u505c\u6b62
consolebase.common.uninstall       = \u30a2\u30f3\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb
consolebase.common.usage           = \u4f7f\u7528\u65b9\u6cd5
consolebase.common.user            = \u30e6\u30fc\u30b6\u30fc
consolebase.common.userName        = \u30e6\u30fc\u30b6\u30fc\u540d

realmwizard._sql.JDBCDriverClassExp              = JDBC \u30c9\u30e9\u30a4\u30d0\u30fc\u306e\u5b8c\u5168\u4fee\u98fe\u30af\u30e9\u30b9\u540d\u3002\u3053\u306e\u30c9\u30e9\u30a4\u30d0\u30fc\u306f\u6b21\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u306b\u6307\u5b9a\u3055\u308c\u308b JAR \u306b\u540c\u68b1\u3055\u308c\u3066\u3044\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
realmwizard._sql.JDBCPasswordExp                 = \u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3068\u306e\u63a5\u7d9a\u3067\u4f7f\u7528\u3059\u308b\u30d1\u30b9\u30ef\u30fc\u30c9
realmwizard._sql.JDBCUrlExp                      = \u63a5\u7d9a\u5148\u306e\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u8a73\u7d30\u3092\u6307\u5b9a\u3059\u308b JDBC URL \u3002\u3053\u308c\u306f\u3001\u5404 JDBC \u30c9\u30e9\u30a4\u30d0\u30fc\u306b\u3088\u3063\u3066\u7570\u306a\u308a\u307e\u3059\u3002
realmwizard._sql.JDBCUsernameExp                 = \u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3068\u306e\u63a5\u7d9a\u3067\u4f7f\u7528\u3059\u308b\u30e6\u30fc\u30b6\u30fc\u540d
realmwizard._sql.databasePoolExp                 = \u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3068\u306e\u63a5\u7d9a\u3067\u30ed\u30b0\u30a4\u30f3\u30fb\u30e2\u30b8\u30e5\u30fc\u30eb\u304c\u4f7f\u7528\u3059\u308b\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30fb\u30d7\u30fc\u30eb\u3002\u3053\u308c\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u308b\u3068\u3001\u6b8b\u308a\u306e\u8a2d\u5b9a\u304c\u4eca\u5f8c\u4e0d\u8981\u306b\u306a\u308a\u307e\u3059\u3002
realmwizard._sql.digestAlgorithmExp              = \u30d1\u30b9\u30ef\u30fc\u30c9\u3067\u4f7f\u7528\u3055\u308c\u308b\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30c0\u30a4\u30b8\u30a7\u30b9\u30c8\u306e\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0 (\u4f8b. MD5\u3001SHA1\u3001\u7b49)\u3002\u30c0\u30a4\u30b8\u30a7\u30b9\u30c8\u306e\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0\u3092\u4f7f\u7528\u3057\u306a\u3044\u5834\u5408\u306f\u3001\u3053\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u7a7a\u6b04\u306e\u307e\u307e\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
realmwizard._sql.digestEncodingExp               = \u30c0\u30a4\u30b8\u30a7\u30b9\u30c8\u3067\u4f7f\u7528\u3059\u308b\u30a8\u30f3\u30b3\u30fc\u30c7\u30a3\u30f3\u30b0 (\u4f8b. hex\u3001base64)\u3002\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30c0\u30a4\u30b8\u30a7\u30b9\u30c8\u306e\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0\u3092\u6307\u5b9a\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u306e\u307f\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002\u30a8\u30f3\u30b3\u30fc\u30c7\u30a3\u30f3\u30b0\u3092\u4f55\u3082\u6307\u5b9a\u3057\u306a\u3044\u3068\u3001hex \u304c\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
realmwizard._sql.driverJARExp                    = \u9078\u629e\u3057\u305f JDBC \u30c9\u30e9\u30a4\u30d0\u30fc\u3092\u540c\u68b1\u3057\u3066\u3044\u308b JAR \u3002\u3053\u306e\u4e00\u89a7\u306b\u8868\u793a\u3055\u305b\u308b\u305f\u3081\u306b\u306f\u3001GERONIMO/repository/ \u914d\u4e0b\u306b\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u3066\u3044\u306a\u3044\u3068\u3044\u3051\u307e\u305b\u3093\u3002
realmwizard._sql.eitherPoolOrJDBC                = SQL \u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30ec\u30eb\u30e0\u306f\u3001\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3078\u63a5\u7d9a\u3059\u308b\u305f\u3081\u306e\u3001\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30fb\u30d7\u30fc\u30eb\u3001\u3082\u3057\u304f\u306f\u3001JDBC \u63a5\u7d9a\u8a2d\u5b9a\u306e\u3069\u3061\u3089\u304b\u3092\u6301\u3063\u3066\u3044\u306a\u3044\u3068\u3044\u3051\u307e\u305b\u3093\u3002\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30fb\u30d7\u30fc\u30eb\u3001\u3082\u3057\u304f\u306f\u3001\u6b8b\u308a\u306e JDBC \u8a2d\u5b9a\u306e\u3069\u3061\u3089\u304b\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
realmwizard._sql.groupSelectSQLExp               = \u30e6\u30fc\u30b6\u30fc\u306e\u30b0\u30eb\u30fc\u30d7\u60c5\u5831\u3092\u8aad\u307f\u8fbc\u3080 SQL \u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u30022\u30ab\u30e9\u30e0\u8fd4\u3059\u5fc5\u8981\u304c\u3042\u308a\u30011\u756a\u76ee\u306f\u30e6\u30fc\u30b6\u30fc\u540d\u3067\u30012\u756a\u76ee\u306f\u30b0\u30eb\u30fc\u30d7\u540d\u3067\u3059\u3002\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u306f\u3001\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306b ? \u3092\u542b\u3080 PreparedStatement \u69cb\u6587\u3092\u4f7f\u7528\u3057\u3001\u305d\u306e\u5834\u5408\u30e6\u30fc\u30b6\u30fc\u540d\u306f\u3059\u3079\u3066\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306b\u8a2d\u5b9a\u3055\u308c\u307e\u3059\u3002\u3088\u304f\u3042\u308b\u8a2d\u5b9a\u306f\u3001\u901a\u5e38\u306e\u30b9\u30ad\u30fc\u30de\u306b\u5bfe\u3059\u308b\u3001<tt>SELECT username, group_name FROM user_groups WHERE username=?</tt> \u307e\u305f\u306f <tt>SELECT u.username, g.name FROM app_users u, groups g, user_groups ug WHERE ug.user_id=users.id AND ug.group_id=g.id AND u.username=?</tt> \u3067\u3059\u3002
realmwizard._sql.selectDatabasePool              = \u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3078\u63a5\u7d9a\u3059\u308b\u305f\u3081\u306e\u3001\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30fb\u30d7\u30fc\u30eb \u3082\u3057\u304f\u306f JDBC \u63a5\u7d9a\u8a2d\u5b9a\u306e\u3069\u3061\u3089\u304b\u3092\u6301\u3063\u3066\u3044\u308b SQL \u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30ec\u30eb\u30e0\u3002\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30fb\u30d7\u30fc\u30eb\u3001\u3082\u3057\u304f\u306f\u3001\u3053\u308c\u4ee5\u964d\u306e JDBC \u8a2d\u5b9a\u306e\u3069\u3061\u3089\u304b\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
realmwizard._sql.userSelectSQLExp                = \u30e6\u30fc\u30b6\u30fc/\u30d1\u30b9\u30ef\u30fc\u30c9\u60c5\u5831\u3092\u8aad\u307f\u8fbc\u3080 SQL \u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u30022\u30ab\u30e9\u30e0\u8fd4\u3059\u5fc5\u8981\u304c\u3042\u308a\u30011\u756a\u76ee\u306f\u30e6\u30fc\u30b6\u30fc\u540d\u3067\u30012\u756a\u76ee\u306f\u30d1\u30b9\u30ef\u30fc\u30c9\u3067\u3059\u3002\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u306f\u3001\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306b ? \u3092\u542b\u3080 PreparedStatement \u69cb\u6587\u3092\u4f7f\u7528\u3057\u3001\u305d\u306e\u5834\u5408\u30e6\u30fc\u30b6\u30fc\u540d\u306f\u3059\u3079\u3066\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306b\u8a2d\u5b9a\u3055\u308c\u307e\u3059\u3002\u3088\u304f\u3042\u308b\u8a2d\u5b9a\u306f\u3001<tt>SELECT username, password FROM app_users WHERE username=?</tt> \u3067\u3059\u3002
realmwizard.advanced.AuditEnabledExp             = \u53ef\u80fd\u3067\u3042\u308c\u3070\u3001\u3059\u3079\u3066\u306e\u30ed\u30b0\u30a4\u30f3\u306e\u8a66\u884c\u3092\u7279\u5b9a\u306e\u30d5\u30a1\u30a4\u30eb\u306b\u8a18\u9332\u3092\u6b8b\u3057\u307e\u3059\u3002\u30d1\u30b9\u306f Geronimo \u306e\u30db\u30fc\u30e0\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u3068\u5bfe\u5fdc\u3055\u305b\u308b\u3079\u304d\u3067\u3059 (\u4ee3\u8868\u7684\u306a\u5024\u306f <tt>var/log/login-attempts.log</tt> \u3067\u3059) \u3002
realmwizard.advanced.credentialName              = \u30af\u30ec\u30c7\u30f3\u30b7\u30e3\u30eb\u540d
realmwizard.advanced.credentialNameExp           = \u53ef\u80fd\u3067\u3042\u308c\u3070\u3001\u30ec\u30eb\u30e0\u306f\u7279\u5b9a\u306e\u30af\u30ec\u30c7\u30f3\u30b7\u30e3\u30eb\u540d\u306e\u914d\u4e0b\u306b\u3001\u30b5\u30d6\u30b8\u30a7\u30af\u30c8\u306b\u3042\u308b\u30d7\u30e9\u30a4\u30d9\u30fc\u30c8\u306a\u30af\u30ec\u30c7\u30f3\u30b7\u30e3\u30eb\u306b\u5404\u30e6\u30fc\u30b6\u30fc\u540d\u3068\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u4fdd\u5b58\u3057\u307e\u3059\u3002
realmwizard.advanced.failuresWithin              = \u5931\u6557
realmwizard.advanced.failuresWithinSeconds       = \u79d2
realmwizard.advanced.keepAccountLockedFor        = \u30a2\u30ab\u30a6\u30f3\u30c8\u30fb\u30ed\u30c3\u30af\u3092\u7dad\u6301\u3059\u308b
realmwizard.advanced.keepAccountLockedForSeconds = \u79d2
realmwizard.advanced.lockUserAfter               = \u30e6\u30fc\u30b6\u30fc\u3092\u30ed\u30c3\u30af
realmwizard.advanced.lockoutEnabledExp           = \u53ef\u80fd\u3067\u3042\u308c\u3070\u3001\u500b\u3005\u306e\u30bf\u30a4\u30e0\u30d5\u30ec\u30fc\u30e0\u306b\u304a\u3051\u308b\u5931\u6557\u30ed\u30b0\u30a4\u30f3\u306e\u4e00\u5b9a\u56de\u6570\u306b\u3088\u3063\u3066\u3001\u30e6\u30fc\u30b6\u30fc\u306e\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u3057\u3070\u3089\u304f\u306e\u9593\u30ed\u30c3\u30af\u3055\u305b\u307e\u3059\u3002\u3053\u308c\u306f\u3001\u30d6\u30eb\u30fc\u30c8\u30d5\u30a9\u30fc\u30b9\u30fb\u30a2\u30ab\u30a6\u30f3\u30c8\u653b\u6483\u306b\u5bfe\u3059\u308b\u9632\u5fa1\u7b56\u3067\u3059\u3002
realmwizard.advanced.namedCredential             = \u547d\u540d\u3055\u308c\u305f\u30af\u30ec\u30c7\u30f3\u30b7\u30e3\u30eb
realmwizard.advanced.storePasswordEnabledExp     = \u53ef\u80fd\u3067\u3042\u308c\u3070\u3001\u30ec\u30eb\u30e0\u306f\u30b5\u30d6\u30b8\u30a7\u30af\u30c8\u306b\u3042\u308b\u30d7\u30e9\u30a4\u30d9\u30fc\u30c8\u30fb\u30af\u30ec\u30c7\u30f3\u30b7\u30e3\u30eb\u306e\u5404\u30e6\u30fc\u30b6\u30fc\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u4fdd\u5b58\u3057\u307e\u3059\u3002\u3053\u308c\u306b\u3088\u3063\u3066\u3001\u30ed\u30b0\u30a4\u30f3\u51e6\u7406\u5b8c\u4e86\u5f8c\u306b\u30d1\u30b9\u30ef\u30fc\u30c9\u3078\u306e\u30a2\u30af\u30bb\u30b9\u3092\u8a31\u53ef\u3057\u307e\u3059\u3002\u3053\u308c\u306f\u901a\u5e38\u5fc5\u9808\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
realmwizard.advanced.title                       = <b>\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30ec\u30eb\u30e0\u306e\u4f5c\u6210</b> -- \u30b9\u30c6\u30c3\u30d7 3: \u9ad8\u5ea6\u306a\u69cb\u6210
realmwizard.common.JDBCDriverClass               = JDBC \u30c9\u30e9\u30a4\u30d0\u30fc\u30fb\u30af\u30e9\u30b9
realmwizard.common.JDBCPassword                  = JDBC \u30d1\u30b9\u30ef\u30fc\u30c9
realmwizard.common.JDBCUrl                       = JDBC URL
realmwizard.common.JDBCUsername                  = JDBC \u30e6\u30fc\u30b6\u30fc\u540d
realmwizard.common.addSecurityRealm              = \u65b0\u898f\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30ec\u30eb\u30e0\u306e\u8ffd\u52a0
realmwizard.common.addToEAR                      = EAR \u306b\u8ffd\u52a0
realmwizard.common.configurationOptions          = \u69cb\u6210\u30aa\u30d7\u30b7\u30e7\u30f3
realmwizard.common.controlFlag                   = \u5236\u5fa1\u30d5\u30e9\u30b0
realmwizard.common.databasePool                  = \u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30fb\u30d7\u30fc\u30eb
realmwizard.common.deploy                        = \u30c7\u30d7\u30ed\u30a4
realmwizard.common.deployCommand                 = \u30b3\u30de\u30f3\u30c9\u306e\u30c7\u30d7\u30ed\u30a4
realmwizard.common.deployRealm                   = \u30ec\u30eb\u30e0\u306e\u30c7\u30d7\u30ed\u30a4
realmwizard.common.deploymentPlan                = \u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u30fb\u30d7\u30e9\u30f3
realmwizard.common.digestAlgorithm               = \u30c0\u30a4\u30b8\u30a7\u30b9\u30c8\u30fb\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0
realmwizard.common.digestEncoding                = \u30c0\u30a4\u30b8\u30a7\u30b9\u30c8\u30fb\u30a8\u30f3\u30b3\u30fc\u30c7\u30a3\u30f3\u30b0
realmwizard.common.driverJAR                     = \u30c9\u30e9\u30a4\u30d0\u30fc JAR
realmwizard.common.editRealm                     = \u30ec\u30eb\u30e0\u306e\u7de8\u96c6
realmwizard.common.editSettings                  = \u8a2d\u5b9a\u306e\u7de8\u96c6
realmwizard.common.enableAuditing                = \u691c\u67fb\u3092\u6709\u52b9
realmwizard.common.enableLockout                 = \u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u3092\u6709\u52b9
realmwizard.common.groupSelectSQL                = SELECT SQL \u30b0\u30eb\u30fc\u30d7
realmwizard.common.logFile                       = \u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb
realmwizard.common.loginDomainName               = \u30ed\u30b0\u30a4\u30f3\u30fb\u30c9\u30e1\u30a4\u30f3\u540d
realmwizard.common.loginModule                   = \u30ed\u30b0\u30a4\u30f3\u30fb\u30e2\u30b8\u30e5\u30fc\u30eb
realmwizard.common.loginModuleClass              = \u30ed\u30b0\u30a4\u30f3\u30fb\u30e2\u30b8\u30e5\u30fc\u30eb\u30fb\u30af\u30e9\u30b9
realmwizard.common.nameOfSecurityRealm           = \u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30ec\u30eb\u30e0\u540d
realmwizard.common.principals                    = \u30d7\u30ea\u30f3\u30b7\u30d1\u30eb
realmwizard.common.realmName                     = \u30ec\u30eb\u30e0\u540d
realmwizard.common.realmType                     = \u30ec\u30eb\u30e0\u30fb\u30bf\u30a4\u30d7
realmwizard.common.serverSide                    = \u30b5\u30fc\u30d0\u30fc\u30fb\u30b5\u30a4\u30c9
realmwizard.common.serverWide                    = \u30b5\u30fc\u30d0\u30fc\u5168\u4f53
realmwizard.common.showPlan                      = \u30d7\u30e9\u30f3\u306e\u8868\u793a
realmwizard.common.skipTestAndDeploy             = \u30c6\u30b9\u30c8\u3092\u30b9\u30ad\u30c3\u30d7\u3057\u3066\u30c7\u30d7\u30ed\u30a4
realmwizard.common.skipTestAndShowPlan           = \u30c6\u30b9\u30c8\u3092\u30b9\u30ad\u30c3\u30d7\u3057\u3066\u30d7\u30e9\u30f3\u3092\u8868\u793a
realmwizard.common.storePassword                 = \u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u4fdd\u5b58
realmwizard.common.supportAdvancedMapping        = \u9ad8\u5ea6\u306a\u30de\u30c3\u30d4\u30f3\u30b0\u306e\u30b5\u30dd\u30fc\u30c8
realmwizard.common.testAgain                     = \u518d\u30c6\u30b9\u30c8
realmwizard.common.testLogin                     = \u30c6\u30b9\u30c8\u30fb\u30ed\u30b0\u30a4\u30f3
realmwizard.common.userSelectSQL                 = SELECT SQL \u30e6\u30fc\u30b6\u30fc
realmwizard.configure.title                      = <b>\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30ec\u30eb\u30e0\u306e\u4f5c\u6210</b> -- \u30b9\u30c6\u30c3\u30d7 2: \u30ed\u30b0\u30a4\u30f3\u30e2\u30b8\u30e5\u30fc\u30eb\u306e\u69cb\u6210
realmwizard.edit.configurationOptionsExp         = \u30ed\u30b0\u30a4\u30f3\u30fb\u30e2\u30b8\u30e5\u30fc\u30eb\u306b\u5fc5\u8981\u306a\u69cb\u6210\u30aa\u30d7\u30b7\u30e7\u30f3\u3001\u6a19\u6e96 Java \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u66f8\u5f0f (1\u884c\u3054\u3068\u306b1\u4ef6\u3001<tt>\u540d\u524d=\u5024</tt>)
realmwizard.edit.controlFlagExp                  = \u30ed\u30b0\u30a4\u30f3\u30fb\u30e2\u30b8\u30e5\u30fc\u30eb\u306e\u5236\u5fa1\u30d5\u30e9\u30b0\u3067\u3001\u30ed\u30b0\u30a4\u30f3\u30fb\u30e2\u30b8\u30e5\u30fc\u30eb\u304c\u6210\u529f\u3082\u3057\u304f\u306f\u5931\u6557\u3057\u305f\u5834\u5408\u306b\u5168\u822c\u7684\u306a\u30ed\u30b0\u30a4\u30f3\u51e6\u7406\u3067\u767a\u751f\u5185\u5bb9\u3092\u5236\u5fa1\u3057\u307e\u3059\u3002\u8a73\u7d30\u306f\u3053\u3053\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044
realmwizard.edit.ifLeaveBlank                    = \u4e0b\u306e\u30a8\u30f3\u30c8\u30ea\u30fc\u3068\u540c\u69d8\u306b\u591a\u304f\u306e\u30ed\u30b0\u30a4\u30f3\u30fb\u30e2\u30b8\u30e5\u30fc\u30eb\u3092\u4f7f\u7528\u3059\u308b\u5fc5\u8981\u304c\u306a\u3044\u5834\u5408\u3001\u4f59\u5206\u306a\u30a8\u30f3\u30c8\u30ea\u30fc\u3092\u7a7a\u767d\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
realmwizard.edit.loginDomainExp                  = \u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30ec\u30eb\u30e0\u306e\u3059\u3079\u3066\u306e\u30e2\u30b8\u30e5\u30fc\u30eb\u9593\u3067\u4e00\u610f\u7684\u3067\u306a\u3051\u308c\u3070\u306a\u3089\u306a\u3044\u3001\u30ed\u30b0\u30a4\u30f3\u30fb\u30e2\u30b8\u30e5\u30fc\u30eb\u306e\u30ed\u30b0\u30a4\u30f3\u30fb\u30c9\u30e1\u30a4\u30f3\u3002\u3053\u308c\u306f2\u3064\u306e\u7570\u306a\u308b\u500b\u3005\u306e\u30ed\u30b0\u30a4\u30f3\u30fb\u30e2\u30b8\u30e5\u30fc\u30eb (\u4f8b\u3048\u3070\u30012\u3064\u306e\u7570\u306a\u308b LDAP \u30b5\u30fc\u30d0\u30fc\u3068\u63a5\u7d9a\u3059\u308b2\u3064\u306e LDAP \u30ed\u30b0\u30a4\u30f3\u30fb\u30e2\u30b8\u30e5\u30fc\u30eb) \u3088\u308a\u30d7\u30ea\u30f3\u30b7\u30d1\u30eb\u3092\u8b58\u5225\u3059\u308b\u306e\u306b\u4f7f\u7528\u53ef\u80fd\u3067\u3059\u3002
realmwizard.edit.loginModuleClassExp             = \u30ed\u30b0\u30a4\u30f3\u30fb\u30e2\u30b8\u30e5\u30fc\u30eb\u306e\u5b8c\u5168\u4fee\u98fe\u30af\u30e9\u30b9\u540d\u3002
realmwizard.edit.loginModuleJAR                  = \u30ed\u30b0\u30a4\u30f3\u30fb\u30e2\u30b8\u30e5\u30fc\u30eb JAR
realmwizard.edit.loginModuleJARExp               = \u30ed\u30b0\u30a4\u30f3\u30fb\u30e2\u30b8\u30e5\u30fc\u30eb\u3068\u30d7\u30ea\u30f3\u30b7\u30d1\u30eb\u306e\u30af\u30e9\u30b9\u3092\u542b\u3080 JAR\u3002
realmwizard.edit.realmNameExp                    = \u30b5\u30fc\u30d0\u30fc\u306b\u3042\u308b\u4ed6\u306e\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30ec\u30eb\u30e0\u306e\u540d\u524d\u3068\u7570\u306a\u308b\u540d\u524d (\u540d\u524d\u306b\u306f\u7a7a\u767d\u3092\u542b\u3081\u306a\u3044\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044) \u3002\u4ed6\u306e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306f\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30ec\u30eb\u30e0\u3092\u53c2\u7167\u3059\u308b\u305f\u3081\u306b\u3053\u306e\u540d\u524d\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
realmwizard.edit.serverSideExp                   = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u5185\u3067\u5b9f\u884c\u3055\u308c\u308b\u30b5\u30fc\u30d0\u30fc\u30fb\u30b5\u30a4\u30c9\u306e\u30ed\u30b0\u30a4\u30f3\u30fb\u30e2\u30b8\u30e5\u30fc\u30eb (\u901a\u5e38\u306f\u6b63\u3057\u3044\u3067\u3059) \u3002\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u5074\u306e\u30ed\u30b0\u30a4\u30f3\u30fb\u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u3001\u4f8b\u3048\u3070\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8 OS \u306e\u30b7\u30f3\u30b0\u30eb\u30fb\u30b5\u30a4\u30f3\u30aa\u30f3\u306e\u76ee\u7684\u3067\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u74b0\u5883\u3067\u5b9f\u884c\u3055\u308c\u307e\u3059\u3002
realmwizard.edit.summary                         = <p>\u3053\u306e\u753b\u9762\u3067\u306f\u3001\u65b0\u898f\u3082\u3057\u304f\u306f\u65e2\u5b58\u306e\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30ec\u30eb\u30e0\u3092\u7de8\u96c6\u3057\u307e\u3059\u3002</p><p>\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30ec\u30eb\u30e0\u306f1\u500b\u4ee5\u4e0a\u306e\u30ed\u30b0\u30a4\u30f3\u30fb\u30e2\u30b8\u30e5\u30fc\u30eb\u3092\u6301\u3063\u3066\u3044\u307e\u3059\u3002\u591a\u304f\u306e\u901a\u5e38\u306e\u30ec\u30eb\u30e0\u306b\u306f1\u500b\u306e\u30ed\u30b0\u30a4\u30f3\u30fb\u30e2\u30b8\u30e5\u30fc\u30eb\u3060\u3051\u3092\u6301\u3061\u307e\u3059\u3002\u8ffd\u52a0\u3059\u308b\u30ed\u30b0\u30a4\u30f3\u30fb\u30e2\u30b8\u30e5\u30fc\u30eb\u306b\u306f\u3001\u975e\u5e38\u306b\u57fa\u672c\u7684\u306a\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u60c5\u5831\u306e\u4fdd\u5b58\u3078\u30a2\u30af\u30bb\u30b9\u3057\u305f\u308a\u3001\u30ec\u30eb\u30e0\u306e\u8a8d\u8a3c\u51e6\u7406\u306b\u5f71\u97ff\u3057\u306a\u3044\u30ec\u30eb\u30e0\u306b\u5bfe\u3057\u3066\u691c\u67fb\u3059\u308b\u3088\u3046\u306a\u6a5f\u80fd\u3092\u8ffd\u52a0\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002</p>
realmwizard.edit.supportAdvancedMappingExp       = \u901a\u5e38 Geronimo \u3067\u306f\u540c\u4e00\u306e\u540d\u524d\u3084\u30af\u30e9\u30b9\u3092\u6301\u30642\u3064\u306e\u7570\u306a\u308b\u30d7\u30ea\u30f3\u30b7\u30d1\u30eb\u9593\u3067\u8b58\u5225\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u304c\u30012\u3064\u306e\u7570\u306a\u308b\u30ed\u30b0\u30a4\u30f3\u30fb\u30e2\u30b8\u30e5\u30fc\u30eb\u306b\u3088\u3063\u3066\u4f5c\u308a\u51fa\u3055\u308c\u307e\u3059\u3002\u3053\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u304c\u6709\u52b9\u3068\u306a\u3063\u3066\u3044\u308b\u3068\u3001Geronimo \u306f\u5404\u30d7\u30ea\u30f3\u30b7\u30d1\u30eb\u304b\u3089\u3069\u306e\u30ed\u30b0\u30a4\u30f3\u30fb\u30e2\u30b8\u30e5\u30fc\u30eb\u3084\u30ec\u30eb\u30e0\u304c\u304d\u305f\u306e\u304b\u3092\u8ffd\u8de1\u3059\u308b\u305f\u3081\u306e\u30d7\u30ea\u30f3\u30b7\u30d1\u30eb\u3092 "\u30e9\u30c3\u30d7" \u3057\u307e\u3059\u3002\u3053\u308c\u306b\u3088\u3063\u3066\u3001Geronimo \u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u30fb\u30d7\u30e9\u30f3\u306b\u30de\u30c3\u30d4\u30f3\u30b0\u3059\u308b\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u306e "realm-principal" \u3068 "login-domain-principal" \u306e\u8981\u7d20\u3092\u4f7f\u7528\u3059\u308b\u3088\u3046\u306b\u306a\u308a\u307e\u3059\u3002
realmwizard.list.noSecurityRealms                = \u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30ec\u30eb\u30e0\u306f\u672a\u5b9a\u7fa9\u3067\u3059
realmwizard.list.seeExamples                     = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304b\u3089\u30ec\u30eb\u30e0\u306e\u4f7f\u3044\u65b9\u3092\u53c2\u7167\u3059\u308b\u306b\u306f\u3001\u5404\u30ec\u30eb\u30e0\u306e\u4e00\u89a7\u3088\u308a\u3001<b>\u4f7f\u7528\u65b9\u6cd5</b>\u306e\u30ea\u30f3\u30af\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002\r\n
realmwizard.list.title                           = \u3053\u306e\u753b\u9762\u3067\u306f\u3001\u5229\u7528\u53ef\u80fd\u306a\u3059\u3079\u3066\u306e\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30ec\u30eb\u30e0\u3092\u4e00\u89a7\u8868\u793a\u3057\u307e\u3059\u3002\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30ec\u30eb\u30e0\u304c (\u3084\u3080\u306a\u304f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u30fb\u30d7\u30e9\u30f3\u3092\u5909\u66f4\u3067\u304d\u306a\u3044) \u5358\u4e00\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u4e00\u90e8\u3068\u3057\u3066\u30c7\u30d7\u30ed\u30a4\u3055\u308c\u3066\u3044\u308b\u9593\u3001\u30b5\u30fc\u30d0\u30fc\u30fb\u30b9\u30b3\u30fc\u30d7\u306e\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30ec\u30eb\u30e0\u306f\u7de8\u96c6\u53ef\u80fd\u3067\u3059\u3002
realmwizard.selectType.nameOfSecurityRealmExp    = \u4ed6\u306e\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30ec\u30eb\u30e0\u306e\u540d\u524d\u3068\u7570\u306a\u308b\u540d\u524d (\u540d\u524d\u306b\u306f\u7a7a\u767d\u3092\u542b\u3081\u306a\u3044\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044) \u3002\u4ed6\u306e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306f\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30ec\u30eb\u30e0\u3092\u53c2\u7167\u3059\u308b\u305f\u3081\u306b\u3053\u306e\u540d\u524d\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
realmwizard.selectType.realmTypeExp              = \u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30ec\u30eb\u30e0\u306e\u30de\u30b9\u30bf\u30fc\u3068\u3057\u3066\u4f7f\u7528\u3055\u308c\u3066\u3044\u308b\u30ed\u30b0\u30a4\u30f3\u30fb\u30e2\u30b8\u30e5\u30fc\u30eb\u306e\u30bf\u30a4\u30d7\u3002\u30e6\u30fc\u30b6\u30fc\u30fb\u30d7\u30ea\u30f3\u30b7\u30d1\u30eb\u3092\u64cd\u4f5c\u3059\u308b\u305f\u3081\u306b\u8907\u6570\u306e\u30ed\u30b0\u30a4\u30f3\u30fb\u30e2\u30b8\u30e5\u30fc\u30eb\u3092\u4f7f\u7528\u3059\u308b\u30ab\u30b9\u30bf\u30e0\u30fb\u30ed\u30b0\u30a4\u30f3\u30fb\u30e2\u30b8\u30e5\u30fc\u30eb\u3068\u30ec\u30eb\u30e0\u3092\u542b\u3080\u30de\u30cb\u30e5\u30a2\u30eb\u69cb\u6210\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u3092\u6307\u5b9a\u3059\u308b\u306b\u306f "\u305d\u306e\u4ed6" \u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
realmwizard.selectType.title                     = <b>\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30ec\u30eb\u30e0\u306e\u4f5c\u6210</b> -- \u30b9\u30c6\u30c3\u30d7 1: \u540d\u524d\u3068\u30bf\u30a4\u30d7\u306e\u9078\u629e
realmwizard.showPlan.addToEARExp                 = \u30c8\u30c3\u30d7\u30ec\u30d9\u30eb\u306e\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30ec\u30eb\u30e0\u3068\u3057\u3066\u30c7\u30d7\u30ed\u30a4\u3059\u308b\u4ee3\u308f\u308a\u306b\u3001EAR \u306e\u4e00\u90e8\u3068\u3057\u3066\u3053\u306e\u30ec\u30eb\u30e0\u3092\u30c7\u30d7\u30ed\u30a4\u53ef\u80fd\u3067\u3059\u3002\u3053\u306e\u30d7\u30e9\u30f3\u3092\u4f7f\u3063\u3066\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30ec\u30eb\u30e0\u3092 EAR \u306b\u8ffd\u52a0\u3059\u308b\u306b\u306f\u3001\u4e0a\u8a18\u306e\u30d7\u30e9\u30f3\u304b\u3089 (\u3082\u3057\u3042\u308c\u3070) <tt>dependency</tt> \u8981\u7d20\u3001\u304a\u3088\u3073\u3001<tt>gbean</tt> \u8981\u7d20\u3092\u6301\u3064 <tt>META-INF/geronimo-application.xml</tt> \u30d5\u30a1\u30a4\u30eb\u3092 EAR \u306b\u4f5c\u6210\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u3053\u306e\u3088\u3046\u306a\u611f\u3058\u306b\u306a\u308a\u307e\u3059:
realmwizard.showPlan.deployCommandExp            = \u3053\u306e\u30d7\u30e9\u30f3\u3092\u4f7f\u3063\u3066\u30b3\u30de\u30f3\u30c9\u30e9\u30a4\u30f3\u304b\u3089\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30ec\u30eb\u30e0\u3092\u30c7\u30d7\u30ed\u30a4\u3059\u308b\u306b\u306f\u3001(<tt>security-realm.xml</tt> \u3068\u3044\u3046) \u30d5\u30a1\u30a4\u30eb\u3092\u30b3\u30d4\u30fc\u3057\u3066\u8cbc\u308a\u4ed8\u3051\u3057\u3001\u4fdd\u5b58\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u305d\u306e\u5f8c\u3001\u4ee5\u4e0b\u306e\u30b3\u30de\u30f3\u30c9\u3092\u5b9f\u884c\u3057\u3066\u304f\u3060\u3055\u3044:
realmwizard.showPlan.title                       = <b>\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30ec\u30eb\u30e0\u306e\u4f5c\u6210</b> -- \u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u30fb\u30d7\u30e9\u30f3\u3092\u8868\u793a
realmwizard.testLogin.passwordExp                = \u30ec\u30eb\u30e0\u306b\u30ed\u30b0\u30a4\u30f3\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3059\u308b\u30d1\u30b9\u30ef\u30fc\u30c9\u3002
realmwizard.testLogin.summary                    = \u3053\u3053\u304b\u3089\u30ec\u30eb\u30e0\u306e\u30e1\u30a4\u30f3\u3068\u306a\u308b\u30ed\u30b0\u30a4\u30f3\u30fb\u30e2\u30b8\u30e5\u30fc\u30eb\u306e\u30e6\u30fc\u30b6\u30fc\u540d\u3068\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u30ed\u30b0\u30a4\u30f3\u306b\u6210\u529f\u3057\u3001\u30d7\u30ea\u30f3\u30b7\u30d1\u30eb\u304c\u30e6\u30fc\u30b6\u30fc\u306b\u751f\u6210\u3055\u308c\u308b\u3068\u3001\u53c2\u7167\u3067\u304d\u307e\u3059\u3002\u3053\u308c\u306f\u3001\u30e1\u30a4\u30f3\u3068\u306a\u308b\u30ed\u30b0\u30a4\u30f3\u30fb\u30e2\u30b8\u30e5\u30fc\u30eb\u306e\u8a2d\u5b9a\u304c\u6b63\u3057\u3044\u304b\u3069\u3046\u304b\u306e\u76ee\u5b89\u3092\u610f\u5473\u3057\u307e\u3059\u3002\u691c\u67fb\u3084\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u3068\u3044\u3063\u305f\u9ad8\u5ea6\u306a\u6a5f\u80fd\u306f\u547c\u3073\u51fa\u3057\u307e\u305b\u3093\u3002
realmwizard.testLogin.title                      = <b>\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30ec\u30eb\u30e0\u306e\u4f5c\u6210</b> -- \u30b9\u30c6\u30c3\u30d7 4: \u30c6\u30b9\u30c8\u30fb\u30ed\u30b0\u30a4\u30f3
realmwizard.testLogin.usernameExp                = \u30ec\u30eb\u30e0\u306b\u30ed\u30b0\u30a4\u30f3\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3059\u308b\u30e6\u30fc\u30b6\u30fc\u540d\u3002
realmwizard.testResults.testResults              = \u30c6\u30b9\u30c8\u7d50\u679c
realmwizard.testResults.title                    = <b>\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30ec\u30eb\u30e0\u306e\u4f5c\u6210</b> -- \u30b9\u30c6\u30c3\u30d7 5: \u30ed\u30b0\u30a4\u30f3\u7d50\u679c
realmwizard.usage.applicationCode                = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b3\u30fc\u30c9
realmwizard.usage.applicationCodeExp             = <p>\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u306e\u30ed\u30fc\u30eb\u3092\u5b9f\u884c\u3059\u308b\u305f\u3081\u306e\u7279\u6b8a\u306a\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b3\u30fc\u30c9\u306f\u4e0d\u8981\u3067\u3059\u3002</p><p>\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c <tt>HttpServletRequest.getUserPrincipal()</tt> \u3092\u547c\u3073\u51fa\u3059\u3068\u3001Geronimo \u306f <tt>GeronimoCallerPrincipal</tt> \u3092\u5b9f\u88c5\u3057\u3066\u3044\u308b\u30d7\u30ea\u30f3\u30b7\u30d1\u30eb\u30af\u30e9\u30b9\u3092\u8fd4\u3057\u307e\u3059 -- (<tt>GeronimoUserPrincipal</tt> \u306f <tt>GeronimoCallerPrincipal</tt> \u3092\u5b9f\u88c5\u3057\u3066\u3044\u308b\u305f\u3081) \u901a\u5e38\u306f\u30e6\u30fc\u30b6\u30fc\u540d\u3067\u3059\u3002\u30ab\u30b9\u30bf\u30e0\u30fb\u30ed\u30b0\u30a4\u30f3\u30fb\u30e2\u30b8\u30e5\u30fc\u30eb\u3092\u4f7f\u7528\u3057\u3066\u3044\u305f\u308a\u3001<tt>getUserPrincipal</tt> \u3067\u9593\u9055\u3063\u305f\u7d50\u679c\u3092\u53d6\u5f97\u3057\u305f\u5834\u5408\u3001<tt>GeronimoCallerPrincipal</tt> \u3092\u5b9f\u88c5\u3057\u305f\u30e6\u30fc\u30b6\u30fc\u306e\u30d7\u30ea\u30f3\u30b7\u30d1\u30eb\u30fb\u30af\u30e9\u30b9\u3092\u4f5c\u6210\u3057\u3066\u307f\u3066\u304f\u3060\u3055\u3044\u3002</p> <p>\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c <tt>HttpServletRequest.isUserInRole(role)</tt> \u3092\u547c\u3073\u51fa\u3059\u3068\u3001Geronimo \u306f\u3001\u30ec\u30eb\u30e0\u306e\u30ed\u30b0\u30a4\u30f3\u30fb\u30e2\u30b8\u30e5\u30fc\u30eb\u306b\u3088\u3063\u3066\u30e6\u30fc\u30b6\u30fc\u306b\u30a2\u30b5\u30a4\u30f3\u3055\u308c\u305f\u30d7\u30ea\u30f3\u30b7\u30d1\u30eb\u304c\u524d\u8ff0\u306e\u30ed\u30fc\u30eb\u30fb\u30de\u30c3\u30d4\u30f3\u30b0\u306e\u4e00\u89a7\u306b\u3042\u3063\u305f\u304b\u3069\u3046\u304b\u6b21\u7b2c\u3067 true \u304b false \u3092\u8fd4\u3057\u307e\u3059\u3002</p>
realmwizard.usage.geronimoWebXmlLater            = <p>\u3053\u306e\u4f8b\u306f {0} \u304c Web \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3078\u306e\u3059\u3079\u3066\u306e\u30ed\u30b0\u30a4\u30f3\u3092\u30cf\u30f3\u30c9\u30eb\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b\u3053\u3068\u3092\u793a\u3057\u3066\u3044\u307e\u3059\u3002\u30d7\u30ea\u30f3\u30b7\u30d1\u30eb\u30fb\u30af\u30e9\u30b9\u3068\u30d7\u30ea\u30f3\u30b7\u30d1\u30eb\u540d\u306e\u7d44\u307f\u5408\u308f\u305b\u3092\u4f7f\u7528\u3057\u3066\u30011\u30e6\u30fc\u30b6\u30fc (<tt>root</tt>) \u3068 1\u30b0\u30eb\u30fc\u30d7 (<tt>administrators</tt>) \u306e\u7d44\u307f\u5408\u308f\u305b\u3068 <tt>admin</tt> \u30ed\u30fc\u30eb\u3092\u30de\u30c3\u30d4\u30f3\u30b0\u3057\u307e\u3059\u3002( {0} \u304c\u30ab\u30b9\u30bf\u30e0\u30fb\u30ed\u30b0\u30a4\u30f3\u30fb\u30e2\u30b8\u30e5\u30fc\u30eb\u3092\u4f7f\u7528\u3059\u308b\u5834\u5408\u3001\u30d7\u30ea\u30f3\u30b7\u30d1\u30eb\u30fb\u30af\u30e9\u30b9\u306f\u7570\u306a\u3063\u3066\u3044\u308b\u304b\u3082\u3057\u308c\u307e\u305b\u3093\u304c\u3001\u4e0a\u8a18\u4e00\u89a7\u306e\u30d7\u30ea\u30f3\u30b7\u30d1\u30eb\u306f\u3059\u3079\u3066\u306e\u6a19\u6e96 Geronimo \u30ed\u30b0\u30a4\u30f3\u30fb\u30e2\u30b8\u30e5\u30fc\u30eb\u306b\u3088\u3063\u3066\u30e6\u30fc\u30b6\u30fc\u3068\u30b0\u30eb\u30fc\u30d7\u306e\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002)</p> <p>\u307e\u305f\u5206\u5272\u30ed\u30b0\u30a4\u30f3\u30fb\u30c9\u30e1\u30a4\u30f3\u540d\u3092\u4f7f\u7528\u3059\u308b\u305f\u3081\u306b\u5206\u5272\u30ed\u30b0\u30a4\u30f3\u30fb\u30e2\u30b8\u30e5\u30fc\u30eb\u3092\u69cb\u6210\u3059\u308b\u3053\u3068\u3082\u53ef\u80fd\u306a\u306e\u3067\u3001\u30ed\u30fc\u30eb\u30fb\u30de\u30c3\u30d4\u30f3\u30b0\u306e\u30ed\u30b0\u30a4\u30f3\u30fb\u30c9\u30e1\u30a4\u30f3\u540d\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u3057\u304b\u3057\u306a\u304c\u3089\u3001\u3053\u308c\u306f\u30e6\u30fc\u30b6\u30fc\u3078\u306e\u30d7\u30ea\u30f3\u30b7\u30d1\u30eb\u3092\u30a2\u30b5\u30a4\u30f3\u3057\u3066\u3044\u308b\u591a\u6570\u306e\u30ed\u30b0\u30a4\u30f3\u30fb\u30e2\u30b8\u30e5\u30fc\u30eb\u3092\u6301\u3064\u5834\u5408\u306b\u3068\u3066\u3082\u91cd\u8981\u3067\u3059 (\u3057\u305f\u304c\u3063\u3066\u3001\u30ed\u30b0\u30a4\u30f3\u30fb\u30c9\u30e1\u30a4\u30f3 "Foo" \u306e\u30e6\u30fc\u30b6\u30fc "root" \u306f\u3001\u30ed\u30b0\u30a4\u30f3\u30fb\u30c9\u30e1\u30a4\u30f3 "Bar" \u306e\u30e6\u30fc\u30b6\u30fc "root" \u3068\u306f\u7570\u306a\u308a\u307e\u3059) \u3002</p> <p>\u6700\u5f8c\u306b\u3001<tt>security</tt> \u30bb\u30af\u30b7\u30e7\u30f3\u304c EAR <tt>application.xml</tt> \u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u30fb\u30c7\u30a3\u30b9\u30af\u30ea\u30d7\u30bf\u30fc\u306b\u5ba3\u8a00\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001EAR\u306e\u3069\u306e\u30e2\u30b8\u30e5\u30fc\u30eb\u3092\u7e70\u308a\u8fd4\u3059\u5fc5\u8981\u304c\u3042\u308a\u307e\u305b\u3093 -- \u305d\u308c\u3089\u306f\u540c\u4e00\u306e\u30ed\u30fc\u30eb\u30fb\u30de\u30c3\u30d4\u30f3\u30b0\u60c5\u5831\u3068\u3059\u3079\u3066\u5171\u6709\u3057\u307e\u3059\u3002</p>
realmwizard.usage.geronimoWebXmlPreface          = <p>\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30ec\u30eb\u30e0\u3068\u5404\u30ed\u30fc\u30eb\u306e\u30e1\u30f3\u30d0\u30fc\u3092\u69cb\u6210\u3059\u308b\u306b\u306f\u3001Web \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b <tt>geronimo-web.xml</tt> \u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u30fb\u30d7\u30e9\u30f3\u3092\u6301\u305f\u305b\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002WAR \u306e <tt>WEB-INF</tt> \u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u306b\u540c\u68b1\u3055\u305b\u308b\u304b\u3001\u30b3\u30de\u30f3\u30c9\u30e9\u30a4\u30f3\u4e0a\u3067\u30c7\u30d7\u30ed\u30a4\u30fb\u30c4\u30fc\u30eb\u304b\u3089\u5206\u5272\u3057\u3066\u63d0\u4f9b\u3057\u307e\u3059\u3002</p> <p><tt>geronimo-web.xml</tt> \u30d7\u30e9\u30f3\u306b\u306f\u3001Web \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u30ed\u30b0\u30a4\u30f3\u8a8d\u8a3c\u3067\u4f7f\u7528\u3059\u308b\u30ec\u30eb\u30e0\u3092\u793a\u3059 <tt>security-realm-name</tt> \u8981\u7d20\u3092\u6301\u3063\u3066\u3044\u307e\u3059\u3002\u307e\u305f\u3001<tt>web.xml</tt> \u306b\u4e00\u89a7\u5316\u3055\u308c\u3066\u3044\u308b\u5404 <tt>security-role</tt> \u306e\u30e1\u30f3\u30d0\u30fc\u3068\u306a\u308b\u3079\u304d\u5404\u30e6\u30fc\u30b6\u30fc\u3068\u30b0\u30eb\u30fc\u30d7\u3092\u4e00\u89a7\u5316\u3057\u3066\u3044\u308b <tt>security</tt> \u8981\u7d20\u3082\u8a2d\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002</p>
realmwizard.usage.title                          = \u3053\u306e\u753b\u9762\u3067\u306f\u3001J2EE \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304b\u3089\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30ec\u30eb\u30e0 {0} \u3092\u4f7f\u7528\u3059\u308b\u65b9\u6cd5\u3092\u8aac\u660e\u3057\u307e\u3059\u3002\u3053\u3053\u3067\u53d6\u308a\u4e0a\u3052\u3066\u3044\u308b\u4f8b\u306f Web \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3067\u3059\u304c\u3001\u4ed6\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30e2\u30b8\u30e5\u30fc\u30eb\u3082\u540c\u69d8\u306b\u52d5\u4f5c\u3057\u307e\u3059\u3002
realmwizard.usage.webXmlShouldHave               = <p><tt>web.xml</tt> \u306b\u306f\u4ee5\u4e0b\u306e\u8981\u7d20\u3092\u6301\u3063\u3066\u3044\u307e\u3059</p><ul>  <li>\u4fdd\u8b77\u3055\u308c\u305f\u753b\u9762\u307e\u305f\u306f URL \u3092\u6307\u5b9a\u3059\u308b\u30011\u4ef6\u4ee5\u4e0a\u306e <tt>security-constraint</tt> \u30d6\u30ed\u30c3\u30af</li>  <li>\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u30ed\u30b0\u30a4\u30f3\u65b9\u5f0f\u3092\u69cb\u6210\u3059\u308b\u3001 <tt>login-config</tt> \u30bb\u30af\u30b7\u30e7\u30f3</li>  <li>\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3067\u4f7f\u7528\u3055\u308c\u308b\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30ed\u30fc\u30eb\u3092\u4e00\u89a7\u306b\u3057\u305f\u30011\u4ef6\u4ee5\u4e0a\u306e <tt>security-role</tt> \u30d6\u30ed\u30c3\u30af</li></ul>
